export default {
  projections: {
    ПланЗакупокE: {
      номер: {
        __caption__: 'Номер'
      },
      датаНачала: {
        __caption__: 'Дата начала'
      },
      контрагенты: {
        __caption__: 'Контрагенты',
        контрагент: {
          __caption__: 'Контрагент'
        }
      },
      организации: {
        __caption__: 'Организации',
        организация: {
          __caption__: 'Организация'
        }
      },
      склады: {
        __caption__: 'Склады',
        склад: {
          __caption__: 'Склад'
        }
      },
      план: {
        __caption__: 'План',
        количество: {
          __caption__: 'Количество'
        },
        этоУслуга: {
          __caption__: 'Это услуга'
        },
        номенклатура: {
          __caption__: 'Номенклатура',
          номенклатура: {
            __caption__: 'Номенклатура'
          }
        }
      }
    },
    ПланЗакупокL: {
      номер: {
        __caption__: 'Номер'
      },
      датаНачала: {
        __caption__: 'Дата начала'
      },
      контрагенты: {
        __caption__: 'Контрагент',
        контрагент: {
          __caption__: 'Контрагент'
        }
      },
      организации: {
        __caption__: 'Организация',
        организация: {
          __caption__: 'Организация'
        }
      },
      склады: {
        __caption__: 'Склад',
        склад: {
          __caption__: 'Склад'
        }
      }
    }
  },
  validations: {
    датаНачала: {
      __caption__: 'Дата начала'
    },
    номер: {
      __caption__: 'Номер'
    },
    контрагенты: {
      __caption__: 'Контрагенты'
    },
    организации: {
      __caption__: 'Организации'
    },
    склады: {
      __caption__: 'Склады'
    },
    план: {
      __caption__: 'План'
    }
  }
};
